In [1]:
import random
import pandas as pd
import numpy as np

# Pair Intro Pandas

### Tenemos un csv que se llama medallas.csv

## 1. ¿Qué diferencia hay entre una Serie y un DataFrame?

In [2]:
#       La Serie tiene una dimensión y el Dataframe tiene dos

## 2. Crea dos listas:

### Una que se llame "valores" que tenga 7 números aleatorios.

In [3]:
valores = [random.randint(1, 50) for x in range (7)]
valores

[11, 26, 11, 45, 31, 23, 47]

### Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [4]:
indices = ["lunes", "martes", "miercoles", "jueves", "viernes", "sabado", "domingo"]
indices

['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado', 'domingo']

### A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie  y la variable indices sean los índices de la Serie.

In [5]:
serie_semana = pd.Series(valores, indices)
serie_semana

lunes        11
martes       26
miercoles    11
jueves       45
viernes      31
sabado       23
domingo      47
dtype: int64

### A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez.

In [6]:
diccionario = {}
for i,x in zip(valores, indices): # i son valores(numeros) y x son indices(dias semana)
    diccionario[x]=i

print(diccionario)

{'lunes': 11, 'martes': 26, 'miercoles': 11, 'jueves': 45, 'viernes': 31, 'sabado': 23, 'domingo': 47}

### Crea una Serie con el diccionario creado en el punto anterior.

In [7]:
serie_diccionario = pd.Series(diccionario)
serie_diccionario

lunes        11
martes       26
miercoles    11
jueves       45
viernes      31
sabado       23
domingo      47
dtype: int64

### ¿Qué forma tiene esta última Serie?

In [8]:
serie_diccionario.shape #Tiene 7 filas, es unidimensional

(7,)

### ¿Qué tipo de datos tiene?

In [9]:
serie_diccionario.dtypes # Tiene integers

dtype('int64')

### ¿Qué tamaño tiene?

In [10]:
serie_diccionario.size # Tiene 7 elementos

7

### ¿Cuáles son los índices de la Serie?

In [11]:
serie_diccionario.index #Los indices son los dias de la semana

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

### ¿Y los values?

In [12]:
serie_diccionario.values # Los values son los números de la lista

array([11, 26, 11, 45, 31, 23, 47])

### Extrae el valor para el índice "lunes"

In [13]:
serie_diccionario["lunes"]

11

### Extrae el valor para el índice "lunes", "martes" y "miércoles".

In [14]:
serie_diccionario[["lunes", "martes", "miercoles"]]

lunes        11
martes       26
miercoles    11
dtype: int64

In [15]:
serie_diccionario["lunes":"miercoles"] #Así cogemos un rango

lunes        11
martes       26
miercoles    11
dtype: int64

### Extrae el valor para el índice "lunes" y "domingo".

In [16]:
serie_diccionario[["lunes", "domingo"]]

lunes      11
domingo    47
dtype: int64

# 3. Es el turno de los DataFrames

### Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [17]:
array = np.empty((4,3))
array

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

### Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [18]:
df_array = pd.DataFrame(array, columns=["España", "Francia", "Italia"])
df_array

   España  Francia  Italia
0     0.0      0.0     0.0
1     0.0      0.0     0.0
2     0.0      0.0     0.0
3     0.0      0.0     0.0

### Descarga el archivo "medallas" y carga el DataFrame.

In [19]:
df_medallas = pd.read_csv("medallas.csv", index_col=0)
df_medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

### Usando el loc extrae todas las columnas de la fila de Tailandia.

In [20]:
df_medallas.loc[7, :]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

### Usando el loc extrae todas las columnas de China e Irán.

In [21]:
df_medallas.loc[[1,4]]

    País   Oro  Plata  Bronce
1  China  1473    994     720
4   Irán   179    181     197

### Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [22]:
df_medallas.loc[[1,4], ["Oro", "Plata", "Bronce"]]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

### Usando el iloc extrae la información de la India. Devolved todas las columnas.

In [23]:
df_medallas.iloc[5]

País      India
Oro         154
Plata       202
Bronce      315
Name: 6, dtype: object

### Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [24]:
df_medallas.iloc[1::2]

               País   Oro  Plata  Bronce
2             Japón  1032   1037     985
4              Irán   179    181     197
6             India   154    202     315
8         Indonesia   112    131     240
10  Corea del Norte    91    120     235

### Utilizando el código del ejercicio anterior,selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [25]:
df_medallas.iloc[1::2,1:4]

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235

### ¿Qué país consiguió más de 200 medallas de oro?

In [27]:
df_medallas_oro = df_medallas.loc[df_medallas["Oro"]>200]
df_medallas_oro

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827

### ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

In [30]:

df_medallas_oro_plata = df_medallas.loc[(df_medallas["Oro"]>200) & (df_medallas["Plata"]>1000)]

df_medallas_oro_plata

    País   Oro  Plata  Bronce
2  Japón  1032   1037     985

### ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [32]:
df_medallas_oro_bronce = df_medallas.loc[(df_medallas["Oro"]>200) & (df_medallas["Bronce"]>700)]

df_medallas_oro_bronce

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827

Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.###

In [35]:


df_medallas['medallas_total'] = df_medallas['Oro']+df_medallas['Plata']+df_medallas['Bronce']

In [36]:
df_medallas.head()

            País   Oro  Plata  Bronce  medallas_total
1          China  1473    994     720            3187
2          Japón  1032   1037     985            3054
3  Corea del Sur   745    663     827            2235
4           Irán   179    181     197             557
5     Kazajistán   155    158     224             537